src/cfe/package-manager/DataProcessors/пм_МенеджерПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>пм_МенеджерПакетов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/package-manager/InformationRegisters/пм_УстановленныеПакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>пм_УстановленныеПакеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаяВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пм_ИсточникиПакетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/package-manager/Catalogs/пм_ИсточникиПакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пм_ИсточникиПакетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пм_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/package-manager/DataProcessors/пм_МенеджерПакетов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	ВосстановитьНастройки();

	Элементы.НадписьНетИсточников.Видимость = Не ЕстьИсточникиПакетов();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("ОбновитьДанныеНаКлиенте", 0.1, Истина);

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыКатегории

&НаКлиенте
Процедура РазделыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбработкаОжиданияУстановкиФильтраПакетов", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПакеты

&НаКлиенте
Процедура ПакетыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("ОбработкаОжиданияУстановкиФильтраВерсий", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПакетыВыбраннаяВерсияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СтрокаПакета = Элементы.Пакеты.ТекущиеДанные;
	Если СтрокаПакета = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СписокВерсий = СписокВерсийПакета(СтрокаПакета);
	Если СписокВерсий.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для пакета нет доступных версий.'"));
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения(
		"ПакетыВыбраннаяВерсияВыборЗавершение", ЭтотОбъект, СтрокаПакета);
	ПоказатьВыборИзСписка(Оповещение, СписокВерсий, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПакетыВыбраннаяВерсияВыборЗавершение(ВыбранныйЭлемент, СтрокаПакета) Экспорт

	Если ВыбранныйЭлемент = Неопределено Или СтрокаПакета = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтрокаПакета.ВыбраннаяВерсия = ВыбранныйЭлемент.Значение;
	ОбновитьИмяФайлаВыбраннойВерсии(СтрокаПакета);

КонецПроцедуры

&НаКлиенте
Процедура ПакетыВыбраннаяВерсияПриИзменении(Элемент)

	СтрокаПакета = Элементы.Пакеты.ТекущиеДанные;
	Если СтрокаПакета = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбновитьИмяФайлаВыбраннойВерсии(СтрокаПакета);

КонецПроцедуры

&НаКлиенте
Процедура ПакетыАвтообновлениеПриИзменении(Элемент)

	СтрокаПакета = Элементы.Пакеты.ТекущиеДанные;
	Если СтрокаПакета = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтрокаПакета.УстановленнаяВерсия) Тогда
		СтрокаПакета.Автообновление = Ложь;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Автообновление можно включить только у установленного пакета.'"));
		Возврат;
	КонецЕсли;

	Если СтрСравнить(СтрокаПакета.Имя, пм_МенеджерПакетовКлиентСервер.ИмяРасширенияМенеджера()) = 0 Тогда
		СтрокаПакета.Автообновление = Ложь;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Сам менеджер пакетов по расписанию не обновляется.'"));
		Возврат;
	КонецЕсли;

	Если Не ЗаписатьАвтообновлениеНаСервере(
		СтрокаПакета.Источник, СтрокаПакета.Имя, СтрокаПакета.Автообновление) Тогда

		СтрокаПакета.Автообновление = Не СтрокаПакета.Автообновление;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Не удалось записать признак автообновления.'"));

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьСтроки(Команда)

	УстановитьОтметку(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСтрок(Команда)

	УстановитьОтметку(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)

	ОбновитьДанныеНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура Скачать(Команда)

	СтрокиПакетов = ОписанияОтмеченныхПакетов();
	Если СтрокиПакетов.Количество() = 0 Тогда

		СтрокаПакета = Элементы.Пакеты.ТекущиеДанные;
		Если СтрокаПакета = Неопределено Тогда
			Возврат;
		КонецЕсли;

		СтрокиПакетов.Добавить(ОписаниеУстановкиСтроки(СтрокаПакета));

	КонецЕсли;

	НачатьУстановкуПакетов(СтрокиПакетов);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыбранные(Команда)

	СтрокиПакетов = ОписанияОтмеченныхПакетов();
	Если СтрокиПакетов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте пакеты для установки.'"));
		Возврат;
	КонецЕсли;

	НачатьУстановкуПакетов(СтрокиПакетов);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсточники(Команда)

	ОткрытьСписокИсточников();

КонецПроцедуры

&НаКлиенте
Процедура НадписьНетИсточниковНажатие(Элемент)

	ОткрытьСписокИсточников();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОбновления(Команда)

	// Пересчет идет по уже загруженному каталогу: обращаться к источнику
	// повторно не нужно, версии и установленные номера уже на форме.
	КоличествоОбновлений = ОтметитьДоступныеОбновления();

	Если КоличествоОбновлений = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Все пакеты актуальны.'");
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Доступно обновлений: %1.'"), КоличествоОбновлений);
	КонецЕсли;

	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Проверка обновлений'"), , ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)

	ОткрытьФормуНастроек();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)

	ОбновитьДанныеНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокИсточников()

	ОткрытьФорму("Справочник.пм_ИсточникиПакетов.ФормаСписка");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИсточникиПакетов()

	Возврат Обработки.пм_МенеджерПакетов.ИсточникиКаталога(Новый Структура).Количество() > 0;

КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьАвтообновлениеНаСервере(Источник, ИмяПакета, Автообновление)

	Возврат РегистрыСведений.пм_УстановленныеПакеты.УстановитьАвтообновление(
		Источник, ИмяПакета, Автообновление);

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастроек()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛимитВерсий", ЛимитВерсий);

	ОткрытьФорму(
		"Обработка.пм_МенеджерПакетов.Форма.Настройки",
		ПараметрыФормы,
		ЭтотОбъект,,,, Новый ОписаниеОповещения("ИзменитьНастройкиНаКлиентеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаКлиенте()

	ДлительнаяОперация = ЗагрузитьСписокПакетов();

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючСтрокиПакеты", КлючТекущейСтроки("Пакеты", "Имя, Источник"));
	ДополнительныеПараметры.Вставить("КлючСтрокиКатегории", КлючТекущейСтроки("Категории", "Наименование"));

	ОписаниеОповещения = Новый ОписаниеОповещения("ПриПолученииСпискаПакетов", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыОжидания = пм_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);

	пм_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗагрузитьСписокПакетов()

	ПараметрыВыполнения = пм_ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение списка пакетов из менеджера пакетов'");

	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Источник", Источник);
	ПараметрыКоманды.Вставить("ЛимитВерсий", ЛимитВерсий);
	ПараметрыКоманды.Вставить("ФильтрВерсий", "");

	ИмяМетода = "Обработки.пм_МенеджерПакетов.ДанныеМенеджераПакетов";

	Возврат пм_ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, ПараметрыКоманды);

КонецФункции

&НаСервере
Процедура ПриПолученииСпискаПакетовНаСервере(АдресРезультата)

	ОтветСервиса = ПолучитьИзВременногоХранилища(АдресРезультата);

	Если ОтветСервиса = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Категории.Загрузить(ОтветСервиса.Категории);
	Пакеты.Загрузить(ОтветСервиса.Пакеты);
	Версии.Загрузить(ОтветСервиса.Версии);

	Элементы.НадписьНетИсточников.Видимость = Не ЕстьИсточникиПакетов();

	Если ОтветСервиса.Свойство("ОшибкиИсточников") Тогда
		Для Каждого ТекстОшибки Из ОтветСервиса.ОшибкиИсточников Цикл
			пм_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриПолученииСпискаПакетов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус <> "Выполнено" Тогда
		ПоказатьОшибкуЗагрузкиСписка(Результат);
		Возврат;
	КонецЕсли;

	ПриПолученииСпискаПакетовНаСервере(Результат.АдресРезультата);

	ВосстановитьТекущуюСтроку("Категории", ДополнительныеПараметры.КлючСтрокиКатегории);
	ВосстановитьТекущуюСтроку("Пакеты", ДополнительныеПараметры.КлючСтрокиПакеты);

	ОтметитьДоступныеОбновления();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуЗагрузкиСписка(Результат)

	ТекстОшибки = "";
	Если Результат.Свойство("КраткоеПредставлениеОшибки") Тогда
		ТекстОшибки = Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстОшибки) И Результат.Свойство("ПодробноеПредставлениеОшибки") Тогда
		ТекстОшибки = Результат.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось получить список пакетов.'");
	КонецЕсли;

	ПоказатьПредупреждение(, ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметку(ЗначениеОтметки)

	Для Каждого Строка Из Пакеты Цикл
		Строка.Загружать = ЗначениеОтметки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияУстановкиФильтраВерсий()

	Строка = Элементы.Пакеты.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяПакета", Строка.Имя);
	СтруктураПоиска.Вставить("Источник", Строка.Источник);
	Элементы.Версии.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияУстановкиФильтраПакетов()

	Строка = Элементы.Категории.ТекущиеДанные;
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураПоиска = Новый Структура;
	Если Не Строка.Наименование = "Все" Тогда
		СтруктураПоиска.Вставить("Категория", Строка.Наименование);
	КонецЕсли;
	Элементы.Пакеты.ОтборСтрок = Новый ФиксированнаяСтруктура(СтруктураПоиска);

КонецПроцедуры

&НаКлиенте
Функция СписокВерсийПакета(СтрокаПакета)

	СписокВерсий = Новый СписокЗначений;
	Отбор = Новый Структура("ИмяПакета, Источник", СтрокаПакета.Имя, СтрокаПакета.Источник);

	Для Каждого СтрокаВерсии Из Версии.НайтиСтроки(Отбор) Цикл
		СписокВерсий.Добавить(СтрокаВерсии.Номер, СтрокаВерсии.Номер);
	КонецЦикла;

	Возврат СписокВерсий;

КонецФункции

&НаКлиенте
Процедура ОбновитьИмяФайлаВыбраннойВерсии(СтрокаПакета)

	Отбор = Новый Структура;
	Отбор.Вставить("ИмяПакета", СтрокаПакета.Имя);
	Отбор.Вставить("Источник", СтрокаПакета.Источник);
	Отбор.Вставить("Номер", СтрокаПакета.ВыбраннаяВерсия);

	Найденные = Версии.НайтиСтроки(Отбор);
	Если Найденные.Количество() > 0 Тогда
		СтрокаПакета.ИмяФайла = Найденные[0].ИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ОписанияОтмеченныхПакетов()

	СтрокиПакетов = Новый Массив;

	Для Каждого СтрокаПакета Из Пакеты Цикл
		Если СтрокаПакета.Загружать Тогда
			СтрокиПакетов.Добавить(ОписаниеУстановкиСтроки(СтрокаПакета));
		КонецЕсли;
	КонецЦикла;

	Возврат СтрокиПакетов;

КонецФункции

&НаКлиенте
Функция ОписаниеУстановкиСтроки(СтрокаПакета)

	Описание = Новый Структура;
	Описание.Вставить("Источник", СтрокаПакета.Источник);
	Описание.Вставить("ИмяПакета", СтрокаПакета.Имя);
	Описание.Вставить("Версия", СтрокаПакета.ВыбраннаяВерсия);
	Описание.Вставить("ИмяФайла", СтрокаПакета.ИмяФайла);
	Описание.Вставить("УстановленнаяВерсия", СтрокаПакета.УстановленнаяВерсия);

	Возврат Описание;

КонецФункции

&НаКлиенте
Процедура НачатьУстановкуПакетов(СтрокиПакетов)

	Для Каждого Описание Из СтрокиПакетов Цикл
		Если Не ЗначениеЗаполнено(Описание.Версия) Тогда
			ПоказатьПредупреждение(, СтрШаблон(
				НСтр("ru = 'У пакета %1 нет версии для установки.'"),
				Описание.ИмяПакета));
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Если СтрокиПакетов.Количество() = 1 Тогда
		Описание = СтрокиПакетов[0];
		Если Описание.УстановленнаяВерсия = Описание.Версия Тогда
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Версия %1 пакета %2 уже установлена. Установить ее повторно?'"),
				Описание.Версия, Описание.ИмяПакета);
		Иначе
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Установить версию %1 пакета %2?'"),
				Описание.Версия, Описание.ИмяПакета);
		КонецЕсли;
	Иначе
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'Установить или обновить выбранные пакеты (%1)?'"),
			СтрокиПакетов.Количество());
	КонецЕсли;

	ОповещениеОЗакрытии = Новый ОписаниеОповещения(
		"ВопросСкачатьУстановитьЗавершение", ЭтотОбъект, СтрокиПакетов);
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ВопросСкачатьУстановитьЗавершение(Результат, СтрокиПакетов) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	АдресРезультата = СкачатьПакетыНаСервере(СтрокиПакетов);

	ОбработатьРезультатЗагрузки(АдресРезультата);

КонецПроцедуры

// Менеджер пакетов обновляет сам себя. Согласие спрашивается отдельно
// от обычной установки: последствия другие.
&НаКлиенте
Процедура ПодтвердитьСамообновление(СостояниеЗагрузки)

	ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Вы обновляете сам менеджер пакетов до версии %1.
		           |
		           |Сеанс будет перезапущен сразу после установки: до перезапуска
		           |менеджер продолжит работать на прежнем коде.
		           |
		           |Если новая версия не применится, восстанавливать расширение
		           |придется вручную через Конфигуратор.
		           |
		           |Продолжить?'"),
		СостояниеЗагрузки.Версия);

	Оповещение = Новый ОписаниеОповещения(
		"ПодтвердитьСамообновлениеЗавершение", ЭтотОбъект, СостояниеЗагрузки);

	ПоказатьВопрос(Оповещение, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет,
		, КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьСамообновлениеЗавершение(Результат, СостояниеЗагрузки) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	РезультатУстановки = УстановитьПодтвержденноеСамообновлениеНаСервере(
		СостояниеЗагрузки.АдресФайла,
		СостояниеЗагрузки.Источник,
		СостояниеЗагрузки.ИмяПакета,
		СостояниеЗагрузки.Версия,
		СостояниеЗагрузки.ИмяФайла);

	Если ЗначениеЗаполнено(РезультатУстановки.ТекстОшибки) Тогда
		ПоказатьПредупреждение(, СтрШаблон(
			НСтр("ru = 'Обновить менеджер пакетов не удалось.
			           |
			           |%1'"),
			РезультатУстановки.ТекстОшибки));
		Возврат;
	КонецЕсли;

	// Варианта отложить перезапуск здесь нет: код менеджера уже перезаписан,
	// и текущий сеанс работает на прежней версии.
	Оповещение = Новый ОписаниеОповещения("ЗавершитьСеансПослеСамообновления", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение,
		НСтр("ru = 'Менеджер пакетов обновлен. Сеанс будет перезапущен.'"));

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеансПослеСамообновления(ДополнительныеПараметры) Экспорт

	ЗавершитьРаботуСистемы(Ложь, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиНаКлиентеЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбновитьДанные = ЛимитВерсий <> Результат.ЛимитВерсий;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);

	Если ОбновитьДанные Тогда
		ОбновитьДанныеНаКлиенте();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция КлючТекущейСтроки(ИмяТаблицы, ПоляКлюча)

	КлючСтроки = Новый Структура(ПоляКлюча);

	ТекущаяСтрока = Элементы[ИмяТаблицы].ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = ЭтотОбъект[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока);
		Если ТекущиеДанные <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(КлючСтроки, ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;

	Возврат КлючСтроки;

КонецФункции

&НаКлиенте
Процедура ВосстановитьТекущуюСтроку(ИмяТаблицы, КлючСтроки)

	МассивСтрок = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(КлючСтроки);
	Если МассивСтрок.Количество() > 0 Тогда
		Элементы[ИмяТаблицы].ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СкачатьПакетыНаСервере(СтрокиПакетов)

	ПараметрыЗагрузкиПакетов = Новый Массив;

	Для Каждого Описание Из СтрокиПакетов Цикл
		ПараметрыЗагрузки = Обработки.пм_МенеджерПакетов.НовыеПараметрыЗагрузкиПакета();
		ПараметрыЗагрузки.Источник = Описание.Источник;
		ПараметрыЗагрузки.ИмяПакета = Описание.ИмяПакета;
		ПараметрыЗагрузки.Версия = Описание.Версия;
		ПараметрыЗагрузки.ИмяФайла = Описание.ИмяФайла;
		ПараметрыЗагрузкиПакетов.Добавить(ПараметрыЗагрузки);
	КонецЦикла;

	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Обработки.пм_МенеджерПакетов.ЗагрузитьАктуальныеВерсииПакетов(
		ПараметрыЗагрузкиПакетов, АдресРезультата);

	Возврат АдресРезультата;

КонецФункции

&НаСервере
Функция УстановитьПодтвержденноеСамообновлениеНаСервере(АдресФайла, ИсточникПакета, ИмяПакета, Версия, ИмяФайла)

	Возврат Обработки.пм_МенеджерПакетов.УстановитьПодтвержденныйФайл(
		АдресФайла, ИсточникПакета, ИмяПакета, Версия, ИмяФайла);

КонецФункции

// Помечает пакеты, у которых в источнике есть версия новее установленной.
// Возвращает количество таких пакетов.
&НаКлиенте
Функция ОтметитьДоступныеОбновления()

	Количество = 0;

	Для Каждого СтрокаПакета Из Пакеты Цикл

		СтрокаПакета.ЕстьОбновление = Ложь;

		// Пакет еще не установлен: это первая установка, а не обновление.
		Если Не ЗначениеЗаполнено(СтрокаПакета.УстановленнаяВерсия) Тогда
			Продолжить;
		КонецЕсли;

		НоваяВерсия = "";
		Отбор = Новый Структура("ИмяПакета, Источник", СтрокаПакета.Имя, СтрокаПакета.Источник);
		Для Каждого СтрокаВерсии Из Версии.НайтиСтроки(Отбор) Цикл
			Если Не ЗначениеЗаполнено(НоваяВерсия)
				Или пм_ВерсииПакетов.СравнитьВерсии(СтрокаВерсии.Номер, НоваяВерсия) > 0 Тогда
				НоваяВерсия = СтрокаВерсии.Номер;
			КонецЕсли;
		КонецЦикла;

		Если Не ЗначениеЗаполнено(НоваяВерсия) Тогда
			Продолжить;
		КонецЕсли;

		Если пм_ВерсииПакетов.СравнитьВерсии(НоваяВерсия, СтрокаПакета.УстановленнаяВерсия) > 0 Тогда
			СтрокаПакета.ЕстьОбновление = Истина;
			Количество = Количество + 1;
		КонецЕсли;

	КонецЦикла;

	Возврат Количество;

КонецФункции

&НаКлиенте
Функция СтрокаПакетаПоКлючу(ИмяПакета, ИсточникПакета)

	Отбор = Новый Структура("Имя, Источник", ИмяПакета, ИсточникПакета);
	МассивСтрок = Пакеты.НайтиСтроки(Отбор);

	Если МассивСтрок.Количество() = 0 Тогда
		МассивСтрок = Пакеты.НайтиСтроки(Новый Структура("Имя", ИмяПакета));
	КонецЕсли;

	Возврат ?(МассивСтрок.Количество() > 0, МассивСтрок[0], Неопределено);

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗагрузки(АдресХранилища)

	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если РезультатЗагрузки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЕстьТребующиеПерезагрузки = Ложь;
	Сообщения = Новый Массив;
	УстановленоПакетов = 0;
	ОтложенноеСамообновление = Неопределено;

	Для Каждого СостояниеЗагрузки Из РезультатЗагрузки Цикл

		// Самообновление не прерывает установку остальных пакетов пачки.
		Если СостояниеЗагрузки.ТребуетсяПодтверждениеСамообновления Тогда
			ОтложенноеСамообновление = СостояниеЗагрузки;
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(СостояниеЗагрузки.ТекстОшибки) Тогда
			Сообщения.Добавить(СтрШаблон(
				НСтр("ru = 'Ошибка установки пакета %1.
				           |Причина: %2'"),
				СостояниеЗагрузки.ИмяПакета,
				СокрЛП(СостояниеЗагрузки.ТекстОшибки)));
			Продолжить;
		КонецЕсли;

		УстановленоПакетов = УстановленоПакетов + 1;

		СтрокаПакета = СтрокаПакетаПоКлючу(
			СостояниеЗагрузки.ИмяПакета, СостояниеЗагрузки.Источник);
		Если СтрокаПакета <> Неопределено Тогда
			СтрокаПакета.УстановленнаяВерсия = СостояниеЗагрузки.Версия;
			СтрокаПакета.ЕстьОбновление = Ложь;
			Если СтрокаПакета.ТребуетсяПерезагрузка
				Или СостояниеЗагрузки.ТребуетсяПерезапуск Тогда
				ЕстьТребующиеПерезагрузки = Истина;
			КонецЕсли;
		ИначеЕсли СостояниеЗагрузки.ТребуетсяПерезапуск Тогда
			ЕстьТребующиеПерезагрузки = Истина;
		КонецЕсли;

		// Внешние обработки и отчеты не устанавливаются в базу,
		// а сразу открываются пользователю.
		Если ЗначениеЗаполнено(СостояниеЗагрузки.ИмяФормыВнешнегоФайла) Тогда
			ОткрытьФорму(СостояниеЗагрузки.ИмяФормыВнешнегоФайла);
		КонецЕсли;

	КонецЦикла;

	Если УстановленоПакетов > 0 Или Сообщения.Количество() > 0 Тогда
		СтруктураОповещения = Новый Структура("Сообщения, УстановленоПакетов");
		СтруктураОповещения.Сообщения = Сообщения;
		СтруктураОповещения.УстановленоПакетов = УстановленоПакетов;
		ОповеститьПользователяОРезультатеУстановки(СтруктураОповещения);
	КонецЕсли;

	Если ОтложенноеСамообновление <> Неопределено Тогда
		ПодтвердитьСамообновление(ОтложенноеСамообновление);
		Возврат;
	КонецЕсли;

	Если ЕстьТребующиеПерезагрузки Тогда
		Если Сообщения.Количество() = 0 Тогда
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ПерезапускСеансаПослеЗагрузкиЗавершение", ЭтотОбъект),
				НСтр("ru = 'Установка завершена. Для применения изменений нужно перезапустить сеанс. Перезапустить?'"),
				РежимДиалогаВопрос.ДаНет);
		Иначе
			пм_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Часть пакетов требует перезапуска сеанса.
				           |Автоматический перезапуск отменен из-за ошибок установки других пакетов.'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПользователяОРезультатеУстановки(СтруктураОповещения)

	УстановленоПакетов = 0;

	Если СтруктураОповещения.Свойство("УстановленоПакетов", УстановленоПакетов) И УстановленоПакетов > 0 Тогда

		ТекстУстановлено = пм_ОбщегоНазначенияКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'Установлен'"), НСтр("ru = 'Установлено'"), НСтр("ru = 'Установлено'"), УстановленоПакетов);
		ТекстПакеты = пм_ОбщегоНазначенияКлиентСервер.ФормаМножественногоЧисла(
				НСтр("ru = 'пакет'"), НСтр("ru = 'пакета'"), НСтр("ru = 'пакетов'"), УстановленоПакетов);

		ТекстСообщения = НСтр("ru = '%Установлено% %КоличествоУстановленых% %пакетов%'");

		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Установлено%", ТекстУстановлено);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КоличествоУстановленых%", УстановленоПакетов);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%пакетов%", ТекстПакеты);

		ТекстЗаголовка = НСтр("ru = 'Установка завершена'");

	Иначе

		ТекстСообщения = НСтр("ru = 'Не установлен ни один пакет'");
		ТекстЗаголовка = НСтр("ru = 'Установка завершена'");

	КонецЕсли;
	ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстСообщения);

	Если СтруктураОповещения.Свойство("Сообщения") И ЗначениеЗаполнено(СтруктураОповещения.Сообщения) Тогда

		ОчиститьСообщения();
		Для каждого ТекстСообщения Из СтруктураОповещения.Сообщения Цикл
			пм_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиПриОтветеНаВопрос(РезультатВопроса, ПредставлениеОшибки) Экспорт

	Если РезультатВопроса <> "Подробнее" Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Обработка.пм_МенеджерПакетов.Форма.СообщенияОбОшибках", Новый Структура("Текст", ПредставлениеОшибки));

КонецПроцедуры

&НаКлиенте
Процедура ПерезапускСеансаПослеЗагрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ЗавершитьРаботуСистемы(Ложь, Истина);

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	Настройки = пм_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Обработка.пм_МенеджерПакетов", "Настройки");

	Если ТипЗнч(Настройки) <> Тип("Соответствие") Тогда
		Настройки = Новый Соответствие;
	КонецЕсли;

	Настройки.Вставить("Источник", Источник);
	Настройки.Вставить("ЛимитВерсий", ЛимитВерсий);

	пм_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.пм_МенеджерПакетов", "Настройки", Настройки);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()

	ЗначениеНастроек = пм_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.пм_МенеджерПакетов", "Настройки");

	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда

		Источник = ЗначениеНастроек.Получить("Источник");
		ЛимитВерсий = ЗначениеНастроек.Получить("ЛимитВерсий");

	КонецЕсли;

	Если Не ЗначениеЗаполнено(ЛимитВерсий) Тогда
		ЛимитВерсий = 5;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Пакеты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пакеты.ВыбраннаяВерсия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Пакеты.УстановленнаяВерсия");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Категории.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Категории.Наименование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "Все";

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));

	//

	// Версии, не соответствующие semver, упорядочены по дате создания,
	// а не по номеру. Помечаем их, чтобы порядок не вводил в заблуждение.
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Версии.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Версии.Несемантическая");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	// Курсив - единственная доступная пометка: подсказки среди параметров
	// условного оформления нет. Пояснение вынесено в подсказку колонки.
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,, Истина));

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Пакеты.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пакеты.ЕстьОбновление");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));

КонецПроцедуры

#КонецОбласти
